{
  "name": "brc",
  "fields": [
    {
      "name": "a",
      "descriptor": "I"
    }
  ],
  "methods": [
    {
      "name": "<init>",
      "descriptor": "(Lbql$a;)V"
    },
    {
      "name": "N_",
      "descriptor": "()Lbqp;"
    },
    {
      "name": "a",
      "descriptor": "(Lbpf;Lgs;)V",
      "javadoc": [
        "returns a list of items with the same ID, but different meta (eg: dye returns 16 items)"
      ]
    },
    {
      "name": "a",
      "descriptor": "(Lbqp;Lbwp;Latt;)Lbqp;",
      "javadoc": [
        "Called when the player finishes using this Item (E.g. finishes eating.). Not called when the player stops using the Item before the action is complete."
      ]
    },
    {
      "name": "a",
      "descriptor": "(Lbqp;Lbwp;Ljava/util/List;Lbsc;)V",
      "javadoc": [
        "allows items to add custom lines of information to the mouseover description"
      ]
    },
    {
      "name": "a",
      "descriptor": "(Lbwp;Lbkd;Larz;)Lasb;",
      "javadoc": [
        "Called to trigger the item's \"innate\" right click behavior. To handle when this item is used on a Block, see {@link #onItemUse}."
      ]
    },
    {
      "name": "b",
      "descriptor": "(Lbqp;)I",
      "javadoc": [
        "How long it takes to use or consume an item"
      ]
    },
    {
      "name": "c",
      "descriptor": "(Lbqp;)Lbse;",
      "javadoc": [
        "returns the action that specifies what animation to play when the items is being used"
      ]
    },
    {
      "name": "i",
      "descriptor": "(Lbqp;)Z",
      "javadoc": [
        "Returns true if this item has an enchantment glint. By default, this returns <code>stack.isItemEnchanted()</code>, but other items can override it (for instance, written books always return true).",
        "",
        "Note that if you override this method, you generally want to also call the super version (on {@link Item}) to get the glint for enchanted items. Of course, that is unnecessary if the overwritten version always returns true."
      ]
    },
    {
      "name": "j",
      "descriptor": "(Lbqp;)Ljava/lang/String;",
      "javadoc": [
        "Returns the unlocalized name of this item. This version accepts an ItemStack so different stacks can have different names based on their damage or NBT."
      ]
    }
  ]
}